In [1]:
import pandas as pd

In [4]:
titanic_train_file = "./data/titanic_train.csv"

In [5]:
df = pd.read_csv(titanic_train_file)

In [6]:
len(pd.read_csv(titanic_train_file))

891

In [7]:
df.shape

(891, 12)

In [8]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [9]:
round(df.describe(), 2)

       PassengerId  Survived  Pclass     Age   SibSp   Parch    Fare
count       891.00    891.00  891.00  714.00  891.00  891.00  891.00
mean        446.00      0.38    2.31   29.70    0.52    0.38   32.20
std         257.35      0.49    0.84   14.53    1.10    0.81   49.69
min           1.00      0.00    1.00    0.42    0.00    0.00    0.00
25%         223.50      0.00    2.00   20.12    0.00    0.00    7.91
50%         446.00      0.00    3.00   28.00    0.00    0.00   14.45
75%         668.50      1.00    3.00   38.00    1.00    0.00   31.00
max         891.00      1.00    3.00   80.00    8.00    6.00  512.33

In [10]:
df.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [11]:
numbers = [11, 12, 31, 45, 55]

In [12]:
pass_students = []

for currentValue in numbers:
    if(currentValue > 35):
        pass_students.append(currentValue)

In [13]:
df.mean()

/var/folders/25/_x2h9gqn0ksfkrv1c9g0f30w0000gn/T/ipykernel_47034/2196191759.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

In [14]:
df.std()

/var/folders/25/_x2h9gqn0ksfkrv1c9g0f30w0000gn/T/ipykernel_47034/3390915376.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std()

PassengerId    257.353842
Survived         0.486592
Pclass           0.836071
Age             14.526497
SibSp            1.102743
Parch            0.806057
Fare            49.693429
dtype: float64

In [15]:
print(popped_item)

NameError: name 'popped_item' is not defined

In [16]:
def bark(num):
    print("bl;ah")
    sum = 10 + num
    print(sum)

In [17]:
bark(3)

bl;ah
13

In [18]:
bark(5)

bl;ah
15

In [118]:
def cube(num):
    somevalu = num ** 3
    return somevalu

In [119]:
cube_5 = cube(5)

In [120]:
print(cube_5)

125